import { ITranslation } from './types';

export const el: ITranslation = {
  common: {
    welcome: 'Καλώς ορίσατε',
    error: 'Προέκυψε ένα σφάλμα',
    loading: 'Φόρτωση...',
    noUserFound:
      'Δεν είστε εξουσιοδοτημένοι να κάνετε αυτό το αίτημα. Παρακαλώ συνδεθείτε',
    userIdMissing:
      'Φαίνεται ότι λείπει το αναγνωριστικό χρήστη. Παρακαλώ δώστε το για να συνεχίσετε',
    scanLimitReached:
      'Φτάσατε τον μέγιστο αριθμό επιτρεπόμενων σαρώσεων. Παρακαλώ αναβαθμίστε το πλάνο σας για να συνεχίσετε να χρησιμοποιείτε την υπηρεσία',
    mandatoryLanguage: 'Ο κωδικός γλώσσας απαιτείται',
  },
  auth: {
    signIn: 'Σύνδεση',
    signUp: 'Εγγραφή',
  },

  loginUserViaEmail: {
    mandatoryEmail: 'Παρακαλώ δώστε τη διεύθυνση email σας για να συνεχίσετε',
    invalidEmail:
      'Η διεύθυνση email που εισάγατε είναι άκυρη. Παρακαλώ επαληθεύστε την και δοκιμάστε ξανά',
    accountCreated:
      'Ο λογαριασμός σας δημιουργήθηκε επιτυχώς! Παρακαλώ ελέγξτε το email σας για τον κωδικό επαλήθευσης',
    verificationCodeSent:
      'Στείλαμε έναν κωδικό επαλήθευσης στο email σας. Παρακαλώ ελέγξτε τα εισερχόμενά σας',
    internalError:
      'Προέκυψε σφάλμα κατά την επεξεργασία της πιστοποίησής σας μέσω email. Παρακαλώ δοκιμάστε ξανά',
  },

  sendEmailVerification: {
    emailMandatory: 'Απαιτείται διεύθυνση email για να συνεχίσετε',
    emailUsed:
      'Αυτή η διεύθυνση email χρησιμοποιείται ήδη. Παρακαλώ χρησιμοποιήστε διαφορετική',
    userNotFound:
      'Δεν μπορέσαμε να βρούμε τον καθορισμένο χρήστη. Παρακαλώ ελέγξτε τα στοιχεία σας και δοκιμάστε ξανά',
    verificationCodeSent:
      'Ο κωδικός επαλήθευσης στάλθηκε επιτυχώς στο email σας',
    generalError: 'Προέκυψε σφάλμα κατά την έναρξη της επαλήθευσης email',
  },

  getInterpretationByDate: {
    startEndDateRequired: 'Η ημερομηνία έναρξης και λήξης απαιτούνται.',
    startDatePriority:
      'Η ημερομηνία έναρξης δεν μπορεί να είναι μετά την ημερομηνία λήξης.',
    generalError: 'Αδυναμία ανάκτησης αναλύσεων.',
  },

  verifyAuthenticationCode: {
    authCodeMandatory: 'Απαιτείται κωδικός πιστοποίησης για να συνεχίσετε',
    emailAddressMandatory: 'Η διεύθυνση email απαιτείται για να συνεχίσετε',
    userNotFound:
      'Ο καθορισμένος χρήστης δεν βρέθηκε. Παρακαλώ ελέγξτε τα στοιχεία σας και δοκιμάστε ξανά',
    invalidAuthCode:
      'Ουπς! Αυτός δεν είναι έγκυρος κωδικός πιστοποίησης. Παρακαλώ ελέγξτε και δοκιμάστε ξανά!',
    authCodeExpired:
      "Ουπς! Ο κωδικός σας έχει λήξει. Παρακαλώ ξαναπροσπαθήστε σύνδεση με τη διεύθυνση email σας ή κάντε κλικ στο 'Επανάληψη αποστολής κωδικού'",
    authCodeVerified: 'Ο χρήστης επαληθεύτηκε επιτυχώς',
    generalError:
      'Ουπς! Συναντήσαμε σφάλμα κατά την επαλήθευση του κωδικού σας',
  },

  analyzeImage: {
    scanLimitReached:
      'Φτάσατε τον μέγιστο αριθμό επιτρεπόμενων σαρώσεων. Παρακαλώ αναβαθμίστε το πλάνο σας για να συνεχίσετε να χρησιμοποιείτε την υπηρεσία',
    imageMissing:
      'Λείπει η εικόνα. Παρακαλώ επιλέξτε και ανεβάστε μια εικόνα για να συνεχίσετε',
    uploadImageStorageError:
      'Συναντήσαμε σφάλμα κατά το ανέβασμα της εικόνας σας. Παρακαλώ ελέγξτε τη σύνδεσή σας και δοκιμάστε ξανά',
    interpretationNotSaved:
      'Αδυναμία αποθήκευσης του αποτελέσματος ανάλυσης. Παρακαλώ ελέγξτε τη σύνδεσή σας και δοκιμάστε ξανά',
    analysisCompleted: 'Η ανάλυση εικόνας ολοκληρώθηκε επιτυχώς!',
  },
  analyzeVideo: {
    noVideoFound:
      'Λείπει το αρχείο βίντεο. Παρακαλώ επιλέξτε και ανεβάστε ένα βίντεο για να συνεχίσετε',
    uploadVideoStorageError:
      'Συναντήσαμε σφάλμα κατά το ανέβασμα του βίντεό σας. Παρακαλώ ελέγξτε τη σύνδεσή σας και δοκιμάστε ξανά',
    interpretationNotSaved:
      'Αδυναμία αποθήκευσης του αποτελέσματος ανάλυσης. Παρακαλώ ελέγξτε τη σύνδεσή σας και δοκιμάστε ξανά',
    analysisCompleted: 'Η ανάλυση βίντεο ολοκληρώθηκε επιτυχώς!',
  },

  incrementUsersScans: {
    incrementSuccessScan: 'Μια ακόμη σάρωση χρησιμοποιήθηκε',
    generalError: 'Αδυναμία αύξησης του αριθμού σαρώσεων!',
  },
  decrementUserScans: {
    decrementSuccessScan: 'Μια σάρωση αφαιρέθηκε',
    decrementErrorScan:
      'Προέκυψε πρόβλημα κατά την ενημέρωση του αριθμού σαρώσεων. Παρακαλώ δοκιμάστε ξανά αργότερα',
    generalError: 'Αδυναμία μείωσης του αριθμού σαρώσεων!',
  },
  updateUserSubscription: {
    subscribeSuccess: 'Επιτυχής εγγραφή!',
    updateSubscriptionError: 'Αδυναμία ενημέρωσης της συνδρομής χρήστη!',
  },
  updateUserLanguage: {
    updateSuccess: 'Η γλώσσα ενημερώθηκε επιτυχώς!',
    updateError:
      'Προέκυψε απρόσμενο σφάλμα κατά την ενημέρωση της γλώσσας. Παρακαλώ δοκιμάστε ξανά αργότερα',
  },

  getUserInfo: {
    successGetInfo: 'Τα δεδομένα πληροφοριών χρήστη ανακτήθηκε επιτυχώς',
    errorGetInfo:
      'Προέκυψε απρόσμενο σφάλμα κατά την ανάκτηση πληροφοριών χρήστη. Παρακαλώ δοκιμάστε ξανά αργότερα',
  },
  getUserInfoById: {
    noUserInfoData:
      'Το έγγραφο χρήστη υπάρχει, αλλά δεν υπάρχουν διαθέσιμα δεδομένα',
    getUserFetchError: 'Προέκυψε σφάλμα κατά την ανάκτηση πληροφοριών χρήστη',
  },

  updateScanInterpretation: {
    success: 'Η εγγραφή ερμηνείας σάρωσης ενημερώθηκε επιτυχώς!',
    generalError: 'Προέκυψε σφάλμα κατά την ενημέρωση της ερμηνείας σάρωσης',
    paramsRequired:
      "Απαιτούνται τόσο το 'documentId' όσο και τα 'fieldsToUpdate'",
  },
  deleteScanInterpretation: {
    success: 'Η αναφορά διαγράφηκε επιτυχώς!',
    documentIdRequired: "Απαιτείται 'DocumentId' για να συνεχίσετε.",
    generalError:
      'Κάτι πήγε στραβά κατά τη διαγραφή της αναφοράς. Παρακαλώ δοκιμάστε ξανά.',
  },

  getInterpretationByDocumentId: {
    paramsRequired: "Απαιτείται 'DocumentId'",
    noDocIdFound: 'Δεν βρέθηκε κανένα έγγραφο με το παρεχόμενο αναγνωριστικό',
    success: 'Το έγγραφο ανακτήθηκε επιτυχώς',
    generalError:
      'Προέκυψε σφάλμα κατά την ανάκτηση της ερμηνείας για το παρεχόμενο αναγνωριστικό εγγράφου',
  },

  getRecentInterpretation: {
    limitRequired: 'Το όριο πρέπει να είναι αριθμός μεταξύ 1 και 100',
    noInterpretationFound: 'Δεν βρέθηκαν ερμηνείες',
    success: 'Πρόσφατες ερμηνείες ανακτήθηκε επιτυχώς!',
    generalError: 'Προέκυψε σφάλμα κατά την ανάκτηση πρόσφατων ερμηνειών',
    generalErrorAdditional: 'Προέκυψε εσωτερικό σφάλμα διακομιστή',
  },

  storeDeviceToken: {
    deviceTokenRequired: 'Η παροχή ενός token συσκευής είναι υποχρεωτική.',
    generalError: 'Σφάλμα αποθήκευσης token συσκευής',
  },

  sendGlobalPushNotifications: {
    requiredParams:
      'Ο τίτλος και το κείμενο της ειδοποίησης είναι υποχρεωτικά.',
    generalError: 'Προέκυψε σφάλμα κατά την επεξεργασία ειδοποιήσεων',
    generalErrorAdditional: 'Αποτυχία αποστολής καθολικής ειδοποίησης',
  },

  checkDeviceUniqueIdentifier: {
    deviceMandatory: 'Το αναγνωριστικό συσκευής είναι υποχρεωτικό',
    languageMandatory: 'Η γλώσσα είναι υποχρεωτική',
    deviceIdentified: 'Η συσκευή σας έχει αναγνωριστεί επιτυχώς',
    generalError:
      'Προέκυψε σφάλμα κατά τον έλεγχο της δοκιμαστικής περιόδου συσκευής',
  },

  getUserNotification: {
    generalError: 'Αποτυχία ανάκτησης ειδοποιήσεων χρήστη',
    generalErrorAdditional:
      'Προέκυψε σφάλμα κατά την ανάκτηση ειδοποιήσεων χρήστη',
  },

  getScanCategories: {
    noCategoryFound: 'Δεν βρέθηκαν κατηγορίες',
    generalError: 'Προέκυψε σφάλμα κατά την ανάκτηση κατηγοριών σάρωσης',
  },

  uploadScanCategories: {
    successfullyUploaded: 'Οι κατηγορίες σάρωσης ανέβηκαν επιτυχώς',
    generalError: 'Αποτυχία ανεβάσματος κατηγοριών σάρωσης',
  },

  sendUserNotification: {
    noTokenFound:
      'Δεν βρέθηκαν έγκυρα tokens Expo. Αδυναμία αποστολής ειδοποιήσεων',
    generalError: 'Αποτυχία αποστολής ειδοποίησης',
  },

  updateUser: {
    successUpdatedUser: 'Ο χρήστης ενημερώθηκε επιτυχώς',
    updateUserError:
      'Αδυναμία ενημέρωσης της εγγραφής χρήστη. Παρακαλώ δοκιμάστε ξανά.',
  },

  loginUserAnonymously: {
    mandatoryUsername: 'Επιλέξτε ένα ψευδώνυμο και ας ξεκινήσουμε!',
    userLoggedIn: 'Καλώς ορίσατε πάλι! Έχετε συνδεθεί.',
    accountCreated: 'Έχετε συνδεθεί! Απολαύστε την εξερεύνηση!',
    error:
      'Ουπς! Κάτι πήγε στραβά. Παρακαλώ ελέγξτε τη σύνδεσή σας και δοκιμάστε ξανά.',
  },
  continueConversation: {
    messagesLimit:
      'Η Aria είναι σε πλήρη χωρητικότητα! Ανεβάστε άλλη μια σάρωση για να συνεχίσετε να λαμβάνετε αναλύσεις και πληροφορίες',
    conversationNotFound: 'Αδυναμία εύρεσης συνομιλίας',
    serviceIssueAi:
      'Φαίνεται ότι υπάρχει πρόβλημα με την υπηρεσία AI. Παρακαλώ δοκιμάστε ξανά.',
    noResponseAiService:
      'Αποτυχία λήψης έγκυρης απάντησης από την υπηρεσία AI. Παρακαλώ δοκιμάστε ξανά',
  },
};
