import { ITranslation } from './types';

export const uk: ITranslation = {
  common: {
    welcome: 'Ласкаво просимо',
    error: 'Сталася помилка',
    loading: 'Завантаження...',
    noUserFound:
      'Ви не авторизовані для цього запиту. Будь ласка, увійдіть в систему',
    userIdMissing:
      'Схоже, відсутній ідентифікатор користувача. Будь ласка, надайте його для продовження',
    scanLimitReached:
      'Ви досягли максимальної дозволеної кількості сканувань. Будь ласка, оновіть свій тарифний план для продовження використання сервісу',
    mandatoryLanguage: "Код мови обов'язковий",
  },
  auth: {
    signIn: 'Увійти',
    signUp: 'Зареєструватися',
  },

  loginUserViaEmail: {
    mandatoryEmail:
      'Будь ласка, надайте свою електронну адресу для продовження',
    invalidEmail:
      'Введена електронна адреса недійсна. Будь ласка, перевірте її та спробуйте ще раз',
    accountCreated:
      'Ваш обліковий запис успішно створено! Будь ласка, перевірте свою електронну пошту для отримання коду підтвердження',
    verificationCodeSent:
      'Ми надіслали код підтвердження на вашу електронну пошту. Будь ласка, перевірте свою поштову скриньку',
    internalError:
      'Сталася помилка під час автентифікації через електронну пошту. Будь ласка, спробуйте ще раз',
  },

  sendEmailVerification: {
    emailMandatory: "Електронна адреса обов'язкова для продовження",
    emailUsed:
      'Ця електронна адреса вже використовується. Будь ласка, використовуйте іншу',
    userNotFound:
      'Ми не змогли знайти вказаного користувача. Будь ласка, перевірте свої дані та спробуйте ще раз',
    verificationCodeSent:
      'Код підтвердження успішно надіслано на вашу електронну пошту',
    generalError:
      'Сталася помилка під час початку підтвердження електронної пошти',
  },

  getInterpretationByDate: {
    startEndDateRequired: "Дата початку та дата завершення обов'язкові.",
    startDatePriority: 'Дата початку не може бути після дати завершення.',
    generalError: 'Не вдалося отримати аналізи.',
  },

  verifyAuthenticationCode: {
    authCodeMandatory: "Код автентифікації обов'язковий для продовження",
    emailAddressMandatory: "Електронна адреса обов'язкова для продовження",
    userNotFound:
      'Вказаного користувача не знайдено. Будь ласка, перевірте свої дані та спробуйте ще раз',
    invalidAuthCode:
      'Ой! Це недійсний код автентифікації. Будь ласка, перевірте та спробуйте ще раз!',
    authCodeExpired:
      "Ой! Ваш код закінчився. Будь ласка, повторіть спробу входу з вашою електронною адресою або натисніть 'Надіслати код ще раз'",
    authCodeVerified: 'Користувача успішно підтверджено',
    generalError: 'Ой! Ми зіткнулися з помилкою під час перевірки вашого коду',
  },

  analyzeImage: {
    scanLimitReached:
      'Ви досягли максимальної дозволеної кількості сканувань. Будь ласка, оновіть свій тарифний план для продовження використання сервісу',
    imageMissing:
      'Відсутнє зображення. Будь ласка, виберіть та завантажте зображення для продовження',
    uploadImageStorageError:
      "Ми зіткнулися з помилкою під час завантаження вашого зображення. Будь ласка, перевірте своє з'єднання та спробуйте ще раз",
    interpretationNotSaved:
      "Не вдалося зберегти результат аналізу. Будь ласка, перевірте своє з'єднання та спробуйте ще раз",
    analysisCompleted: 'Аналіз зображення успішно завершено!',
  },
  analyzeVideo: {
    noVideoFound:
      'Відсутній відеофайл. Будь ласка, виберіть та завантажте відео для продовження',
    uploadVideoStorageError:
      "Ми зіткнулися з помилкою під час завантаження вашого відео. Будь ласка, перевірте своє з'єднання та спробуйте ще раз",
    interpretationNotSaved:
      "Не вдалося зберегти результат аналізу. Будь ласка, перевірте своє з'єднання та спробуйте ще раз",
    analysisCompleted: 'Аналіз відео успішно завершено!',
  },

  incrementUsersScans: {
    incrementSuccessScan: 'Використано ще одне сканування',
    generalError: 'Не вдалося зменшити кількість сканувань!',
  },
  decrementUserScans: {
    decrementSuccessScan: 'Одне сканування зменшено',
    decrementErrorScan:
      'Виникла проблема з оновленням кількості сканувань. Будь ласка, спробуйте пізніше',
    generalError: 'Не вдалося зменшити кількість сканувань!',
  },
  updateUserSubscription: {
    subscribeSuccess: 'Успішно підписано!',
    updateSubscriptionError: 'Не вдалося оновити підписку користувача!',
  },
  updateUserLanguage: {
    updateSuccess: 'Мову успішно оновлено!',
    updateError:
      'Сталася неочікувана помилка під час оновлення мови. Будь ласка, спробуйте пізніше',
  },

  getUserInfo: {
    successGetInfo: 'Дані userInfo успішно отримано',
    errorGetInfo:
      'Сталася неочікувана помилка під час отримання інформації про користувача. Будь ласка, спробуйте пізніше',
  },
  getUserInfoById: {
    noUserInfoData: 'Документ користувача існує, але дані відсутні',
    getUserFetchError:
      'Сталася помилка під час отримання інформації про користувача',
  },

  updateScanInterpretation: {
    success: 'Запис інтерпретації сканування успішно оновлено!',
    generalError: 'Сталася помилка під час оновлення інтерпретації сканування',
    paramsRequired: "'documentId' та 'fieldsToUpdate' обидва обов'язкові",
  },
  deleteScanInterpretation: {
    success: 'Звіт успішно видалено!',
    documentIdRequired: "'DocumentId' обов'язковий для продовження.",
    generalError:
      'Щось пішло не так під час видалення звіту. Будь ласка, спробуйте ще раз.',
  },

  getInterpretationByDocumentId: {
    paramsRequired: "'DocumentId' обов'язковий",
    noDocIdFound: 'Не знайдено жодного документа з наданим ідентифікатором',
    success: 'Документ успішно отримано',
    generalError:
      'Сталася помилка під час отримання інтерпретації для наданого ідентифікатора документа',
  },

  getRecentInterpretation: {
    limitRequired: 'Ліміт має бути числом від 1 до 100',
    noInterpretationFound: 'Інтерпретації не знайдено',
    success: 'Останні інтерпретації успішно отримано!',
    generalError: 'Сталася помилка під час отримання останніх інтерпретацій',
    generalErrorAdditional: 'Сталася внутрішня помилка сервера',
  },

  storeDeviceToken: {
    deviceTokenRequired: "Надання токена пристрою є обов'язковим.",
    generalError: 'Помилка збереження токена пристрою',
  },

  sendGlobalPushNotifications: {
    requiredParams: "Заголовок та тіло сповіщення обов'язкові.",
    generalError: 'Сталася помилка під час обробки сповіщень',
    generalErrorAdditional: 'Не вдалося надіслати глобальне сповіщення',
  },

  checkDeviceUniqueIdentifier: {
    deviceMandatory: "Ідентифікатор пристрою обов'язковий",
    languageMandatory: "Мова обов'язкова",
    deviceIdentified: 'Ваш пристрій успішно ідентифіковано',
    generalError: 'Сталася помилка під час перевірки пробного періоду пристрою',
  },

  getUserNotification: {
    generalError: 'Не вдалося отримати сповіщення користувача',
    generalErrorAdditional:
      'Сталася помилка під час отримання сповіщень користувача',
  },

  getScanCategories: {
    noCategoryFound: 'Категорії не знайдено',
    generalError: 'Сталася помилка під час отримання категорій сканування',
  },

  uploadScanCategories: {
    successfullyUploaded: 'Категорії сканування успішно завантажено',
    generalError: 'Не вдалося завантажити категорії сканування',
  },

  sendUserNotification: {
    noTokenFound:
      'Дійсних токенів Expo не знайдено. Неможливо надіслати сповіщення',
    generalError: 'Не вдалося надіслати сповіщення',
  },

  updateUser: {
    successUpdatedUser: 'Користувача успішно оновлено',
    updateUserError:
      'Не вдалося оновити запис користувача. Будь ласка, спробуйте ще раз.',
  },

  loginUserAnonymously: {
    mandatoryUsername: 'Виберіть псевдонім і почнімо!',
    userLoggedIn: 'Ласкаво просимо назад! Ви увійшли.',
    accountCreated: 'Ви увійшли! Насолоджуйтесь дослідженням!',
    error:
      "Ой! Щось пішло не так. Будь ласка, перевірте своє з'єднання та спробуйте ще раз.",
  },
  continueConversation: {
    messagesLimit:
      'Арія на повній потужності! Завантажте ще одне сканування, щоб продовжувати отримувати аналіз та інсайти',
    conversationNotFound: 'Не вдалося знайти розмову',
    serviceIssueAi:
      'Здається, є проблема з сервісом AI. Будь ласка, спробуйте ще раз.',
    noResponseAiService:
      'Не вдалося отримати дійсну відповідь від сервісу AI. Будь ласка, спробуйте ще раз',
  },
};
